In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
df = pd.read_csv("Module1-homework/green_tripdata_2019-09.csv.gz", nrows=100)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 20 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               100 non-null    int64
 1   lpep_pickup_datetime   100 non-null    object
 2   lpep_dropoff_datetime  100 non-null    object
 3   store_and_fwd_flag     100 non-null    object
 4   RatecodeID             100 non-null    int64
 5   PULocationID           100 non-null    int64
 6   DOLocationID           100 non-null    int64
 7   passenger_count        100 non-null    int64
 8   trip_distance          100 non-null    float64
 9   fare_amount            100 non-null    float64
 10  extra                  100 non-null    float64
 11  mta_tax                100 non-null    float64
 12  tip_amount             100 non-null    float64
 13  tolls_amount           100 non-null    float64
 14  ehail_fee              0 non-null      float64
 15  improvement_surcharge  100 non-null    float64
 16  total_amount           100 non-null    float64
 17  payment_type           100 non-null    int64
 18  trip_type              100 non-null    int64
 19  congestion_surcharge   100 non-null    float64
dtypes: float64(10), int64(7), object(3)
memory usage: 15.8+ KB

In [5]:
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2019-09-01 00:10:53,2019-09-01 00:23:46,N,1,65,189,5,2.00,10.5,0.5,0.5,2.36,0.0,NaN,0.3,14.16,1,1,0.0
1,2,2019-09-01 00:31:22,2019-09-01 00:44:37,N,1,97,225,5,3.20,12.0,0.5,0.5,0.00,0.0,NaN,0.3,13.30,2,1,0.0
2,2,2019-09-01 00:50:24,2019-09-01 01:03:20,N,1,37,61,5,2.99,12.0,0.5,0.5,0.00,0.0,NaN,0.3,13.30,2,1,0.0
3,2,2019-09-01 00:27:06,2019-09-01 00:33:22,N,1,145,112,1,1.73,7.5,0.5,0.5,1.50,0.0,NaN,0.3,10.30,1,1,0.0
4,2,2019-09-01 00:43:23,2019-09-01 00:59:54,N,1,112,198,1,3.42,14.0,0.5,0.5,3.06,0.0,NaN,0.3,18.36,1,1,0.0

In [6]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [7]:
print(pd.io.sql.get_schema(df, name="green_trip_data"))

CREATE TABLE "green_trip_data" (
"VendorID" INTEGER,
  "lpep_pickup_datetime" TIMESTAMP,
  "lpep_dropoff_datetime" TIMESTAMP,
  "store_and_fwd_flag" TEXT,
  "RatecodeID" INTEGER,
  "PULocationID" INTEGER,
  "DOLocationID" INTEGER,
  "passenger_count" INTEGER,
  "trip_distance" REAL,
  "fare_amount" REAL,
  "extra" REAL,
  "mta_tax" REAL,
  "tip_amount" REAL,
  "tolls_amount" REAL,
  "ehail_fee" REAL,
  "improvement_surcharge" REAL,
  "total_amount" REAL,
  "payment_type" INTEGER,
  "trip_type" INTEGER,
  "congestion_surcharge" REAL
)

In [26]:
# Creating connection to the POSTGRESQL
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
try:
    with engine.connect() as connection_str:
            print(f'Successfully connected to the database')
except Exception as ex:
        print(f'Sorry failed to connect: {ex}')

Successfully connected to the database

In [11]:
print(pd.io.sql.get_schema(df, name="green_trip_data", con=engine))

CREATE TABLE green_trip_data (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type BIGINT,
	congestion_surcharge FLOAT(53)
)

#### Since our dataset is large we're loading the data into chunks of 50000 rows.

In [36]:
df_iter = pd.read_csv("Module1-homework/green_tripdata_2019-09.csv.gz", iterator=True, chunksize=50000)

In [37]:
df = next(df_iter)
len(df)

50000

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 20 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               50000 non-null  int64
 1   lpep_pickup_datetime   50000 non-null  object
 2   lpep_dropoff_datetime  50000 non-null  object
 3   store_and_fwd_flag     50000 non-null  object
 4   RatecodeID             50000 non-null  int64
 5   PULocationID           50000 non-null  int64
 6   DOLocationID           50000 non-null  int64
 7   passenger_count        50000 non-null  int64
 8   trip_distance          50000 non-null  float64
 9   fare_amount            50000 non-null  float64
 10  extra                  50000 non-null  float64
 11  mta_tax                50000 non-null  float64
 12  tip_amount             50000 non-null  float64
 13  tolls_amount           50000 non-null  float64
 14  ehail_fee              0 non-null      float64
 15  improvement_surcharge  50000 non-null  float64
 16  total_amount           50000 non-null  float64
 17  payment_type           50000 non-null  int64
 18  trip_type              50000 non-null  int64
 19  congestion_surcharge   50000 non-null  float64
dtypes: float64(10), int64(7), object(3)
memory usage: 7.6+ MB

#### Since the `lpep_pickup_datetime' & `lpep_dropoff_datetime` datas are in format we need to convert them into datetime.

In [39]:
# Converting into the datetime format.
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [40]:
# Checking once again the table schema to be sure correct schema is being created.
print(pd.io.sql.get_schema(df, name="green_taxi_data", con=engine))

CREATE TABLE green_taxi_data (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type BIGINT,
	congestion_surcharge FLOAT(53)
)

#### Writing the first 50000 rows as table for the first time.
#### Since this is the first batch of our data we are using `if_exists=replace` command to overwrite any data if exists before.

In [41]:
%time df.to_sql(name="green_taxi_data", con=engine, if_exists="replace", index=False)

CPU times: user 8.63 s, sys: 729 ms, total: 9.36 s
Wall time: 16.2 s

1000

In [42]:
from time import time

while True:
    try:
        t_start = time()
    
        df = next(df_iter)
        df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
        df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

        # Since the first batch has already been inerted we are using append option for further batches.
        df.to_sql(name='green_taxi_data', con=engine, if_exists='append', index=False)
    
        t_end = time()
    
        print("Inserted another chunk, took %.3f second" % (t_end - t_start))
    except Exception as ex:
            print(ex)
            break

Inserted another chunk, took 16.997 second
Inserted another chunk, took 16.131 second
Inserted another chunk, took 16.649 second
Inserted another chunk, took 18.672 second
Inserted another chunk, took 15.177 second
Inserted another chunk, took 15.997 second
Inserted another chunk, took 16.377 second
Inserted another chunk, took 16.499 second

### Accessing data from the jupyter notebook.
For this purpose we are gonna use the [`ipython-sql`](https://github.com/catherinedevlin/ipython-sql) module.
For installation of the module we use the following command:
``` python
pip install ipython-sql
```
##### Load the extension with the command `%load_ext`

In [31]:
%load_ext sql

# Creating connection
%sql postgresql://root:root@localhost:5432/ny_taxi

In [43]:
%sql SELECT COUNT(1) FROM green_taxi_data;

 * postgresql://root:***@localhost:5432/ny_taxi
1 rows affected.

[(449063,)]

In [44]:
%sql SELECT * FROM green_taxi_data LIMIT 5;

 * postgresql://root:***@localhost:5432/ny_taxi
5 rows affected.

[(2, datetime.datetime(2019, 9, 1, 0, 10, 53), datetime.datetime(2019, 9, 1, 0, 23, 46), 'N', 1, 65, 189, 5, 2.0, 10.5, 0.5, 0.5, 2.36, 0.0, None, 0.3, 14.16, 1, 1, 0.0),
 (2, datetime.datetime(2019, 9, 1, 0, 31, 22), datetime.datetime(2019, 9, 1, 0, 44, 37), 'N', 1, 97, 225, 5, 3.2, 12.0, 0.5, 0.5, 0.0, 0.0, None, 0.3, 13.3, 2, 1, 0.0),
 (2, datetime.datetime(2019, 9, 1, 0, 50, 24), datetime.datetime(2019, 9, 1, 1, 3, 20), 'N', 1, 37, 61, 5, 2.99, 12.0, 0.5, 0.5, 0.0, 0.0, None, 0.3, 13.3, 2, 1, 0.0),
 (2, datetime.datetime(2019, 9, 1, 0, 27, 6), datetime.datetime(2019, 9, 1, 0, 33, 22), 'N', 1, 145, 112, 1, 1.73, 7.5, 0.5, 0.5, 1.5, 0.0, None, 0.3, 10.3, 1, 1, 0.0),
 (2, datetime.datetime(2019, 9, 1, 0, 43, 23), datetime.datetime(2019, 9, 1, 0, 59, 54), 'N', 1, 112, 198, 1, 3.42, 14.0, 0.5, 0.5, 3.06, 0.0, None, 0.3, 18.36, 1, 1, 0.0)]

### Task Completed.